12Tomikos21/nRF5_BP/main.c
/**@brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }
    NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                  p_gatt->att_mtu_desired_central,
                  p_gatt->att_mtu_desired_periph);
}


/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event) {
    uint32_t err_code;
    switch (event) {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE) {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                    APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            break;
    }
}
//######################################################################################################################### NEW DATA
configuration_t newDataInFile (uint32_t timestamp,
                    uint32_t data1) {
  configuration_t data =
{
    .timestamp = timestamp,
    .data1 = data1,
    .crc = 0x0, //crc32_compute(
};
  return data;
}
//######################################################################################################################### WRITE FSD
void static write_fds (void const * p_data) {
  fds_record_desc_t desc = {0};
  fds_record_t const rec =
    {
        .file_id           = fileID,
        .key               = key,
        .data.p_data       = p_data,
        .data.length_words = (sizeof(configuration_t) + 3) / sizeof(uint32_t),
    };
  if (key != FDS_RECORD_KEY_DIRTY && fileID != FDS_FILE_ID_INVALID) {
    configuration_t * p_cfg = (configuration_t *)(p_data);
    printf("W Key:\t0x%04x,data:\t0x%04x T:\t0x%04x, 1:\t0x%04x, c:\t0x%04x\n\n", key, &rec.data.p_data, p_cfg->timestamp, p_cfg->data1, p_cfg->crc);
    ret_code_t rc = fds_record_write(&desc, &rec);
    APP_ERROR_CHECK(rc);

    if (rc != FDS_SUCCESS){
      bsp_board_led_on(BSP_BOARD_LED_3);
    } else {
      key++;
    }
  }

}
//######################################################################################################### get_data from FDS
void get_all_data(uint16_t file_id) {
    fds_record_desc_t desc = {0};
    fds_find_token_t  tok  = {0};
    printf("FOUND\n");
    while (fds_record_iterate(&desc, &tok) != FDS_ERR_NOT_FOUND) {

        fds_flash_record_t record = {0};
        ret_code_t rc = fds_record_open(&desc, &record);

        if (rc == FDS_SUCCESS){

          configuration_t * p_cfg = (configuration_t *)(record.p_data);
          uint32_t const len = record.p_header->length_words * sizeof(uint32_t);
          printf("KEY:\t0x%04x DATA:\t0x%04x T:\t0x%04x, 1:\t0x%04x, c:\t0x%04x\n\n",
          record.p_header->record_key,record.p_data, p_cfg->timestamp, p_cfg->data1, p_cfg->crc);
       
          rc = fds_record_close(&desc);
          APP_ERROR_CHECK(rc);
          p_cfg = NULL;
          nrf_delay_ms(50);
        }
    }
}
//######################################################################################################################### UART SEND
void uart_event_handle(app_uart_evt_t * p_event) {
    static uint8_t send_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t       err_code;
    unsigned char data_arr[] = "";
    switch (p_event->evt_type) {
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&send_array[index]));
            index++;
 
            if ((send_array[index - 1] == '\n') || (index >= m_ble_nus_max_data_len)) {
              if (index > 1) {
                do {
                  if (timestamp != 0) {
                    send_array[--index] = 0;
                    char * num_char = (char *) send_array;
                    uint32_t  num = atoi(num_char);

                    configuration_t newData = newDataInFile(timestamp, num);
                    write_fds(&newData);
                    get_all_data(fileID);

                    uint32_t data1 = newData.data1;
                    sprintf(data_arr, "%d", data1);
                  } else {
                    strcpy(data_arr,"No timestamp");
                  }

